// DONE TODO Обработка ошибок отправки формы
// DONE TODO Хранение пользователя
// DONE TODO Перенести сообщение об ошибке в форму
// DONE TODO Сделать компонент Page
// DONE TODO Сделать все страницы через компонент Page
// DONE TODO Сделать компонент Form
// DONE TODO Сделать все формы через компонент Form
// DONE TODO Переделать компонент формы отправки сообщения как глупый UI компонент
// DONE TODO Сделать общий статус загрузки приложения
// DONE TODO Сделать приватный роутинг
// DONE TODO Вход в систему
// DONE TODO Выход из системы
// DONE TODO Проверка на авторизацию
// DONE TODO Редактирование профиля
// DONE TODO Смена пароля
// DONE TODO Список чатов
// DONE TODO Создать чат
// DONE TODO Добавить пользователя в чат
// DONE TODO Удалить пользователя из чата
// DONE TODO Отправка сообщения
// DONE TODO Смена аватара
