// DONE TODO Обработка ошибок отправки формы
// DONE TODO Хранение пользователя
// DONE TODO Перенести сообщение об ошибке в форму
// DONE TODO Сделать компонент Page
// DONE TODO Сделать все страницы через компонент Page
// DONE TODO Сделать компонент Form
// TODO Сделать все формы через компонент Form
// TODO Переделать компонент формы отправки сообщения как глупый UI компонент
// TODO Создать хоки для changePassword, message и profile, чтобы не было ошибок импорта
// TODO Вход в систему
// TODO Выход из системы
// TODO Проверка на авторизацию
// TODO Смена пароля
// TODO Редактирование профиля
// TODO Отправка сообщения
